#include <stdio.h>

#define 🚦 main
#define 💭 if (
#define 💫 ) {
#define 🚩 {
#define 🏁 }
#define 💞 while
#define 🕳 void
#define 💥 NULL
#define 👊 65
#define 🤚 66
#define 🤞 67
#define 🈴 90
#define 🚼 89
#define 👉 ==
#define 👈 = 🔠[0]
#define 🙂 🔠[2]
#define 🔡 char
#define 🔢 int
#define 💌 stdin
#define 💖 &&
#define 💕 ++
#define 🔼 continue
#define ™ ;
#define 💰 += 3
#define 😅 else

🔡 🔠[👊] ™
🔢 $ ™

🔢 🚦 (🕳) 🚩
🔡 🙃 ™
💞 (fgets(🔠, 👊, 💌) != 💥 💫
🙃 👈 ™
💭 🙃 👉 🤚 💫
    💭 🙂 👉 🚼 💫
        $ 💰 ™ $ 💕 ™ $ 💕 ™ 
        🔼 ™
🏁
    💭 🙂 👉 🈴 💫
        $ 💰 ™ 
        $ 💰 ™ $ 💰 ™
        🔼 ™
🏁
    😅 🚩
        $ 💕 ™ 
        🔼 ™
🏁
🏁
💭 🙃 👉 🤞 💫
    💭 🙂 👉 🚼 💫
        $ 💰 ™ 
        $ 💰 ™ 
        🔼 ™
🏁
    💭 🙂 👉 🈴 💫
        $ 💰 ™ 
        $ 💰 ™ 
        $ 💕 ™ 
        🔼 ™
🏁
    😅 🚩
        $ 💕 ™ 
        $ 💕 ™ 
        🔼 ™
🏁
🏁
💭 🙃 👉 👊 💫
    💭 🙂 👉 🚼 💫
        $ 💰 ™
        $ 💕 ™
        🔼 ™
🏁
    💭 🙂 👉 🈴 💫
        $ 💰 ™ 
        $ 💰 ™ 
        $ 💕 ™ 
        $ 💕 ™
        🔼 ™
🏁
    😅 🚩
        $ 💰 ™ 
        🔼 ™
🏁
🏁
🏁
🏁